MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_comp.h
/**
  ******************************************************************************
  * @file    stm32c5xx_ll_comp.h
  * @brief   Header file of COMP LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5XX_LL_COMP_H
#define STM32C5XX_LL_COMP_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5xx_LL_Driver
  * @{
  */

#if defined(COMP1) || defined(COMP2)

/** @defgroup COMP_LL COMP
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup COMP_LL_Private_Constants COMP Private Constants
  * @{
  */
#define LL_COMP_REG(__COMP__) ((__COMP__)->CFGR1)

/* Internal masks and bitfields for pair of comparators instances window mode
To select into literals LL_COMP_WINDOW_x the relevant bits for (concatenation of multiple bits used in different
registers):
- Comparator instance selected as master for window mode : register offset
- Window mode enable or disable: bit value */
#define LL_COMP_WINDOW_COMP_ODD_REGOFFSET_MASK  (0x00000000UL) /* Register of COMP instance odd (COMP1_CSR, ...)
                                        defined as reference register */
#define LL_COMP_WINDOW_COMP_EVEN_REGOFFSET_MASK (0x00000001UL) /* Register of COMP instance even (COMP2_CSR, ...)
                                        offset vs register of COMP instance odd */
#define LL_COMP_WINDOW_COMP_REGOFFSET_MASK (LL_COMP_WINDOW_COMP_ODD_REGOFFSET_MASK \
                                            | LL_COMP_WINDOW_COMP_EVEN_REGOFFSET_MASK)
#if defined(COMP_CFGR1_WINMODE)
#define LL_COMP_WINDOW_COMP_X_SETTING_MASK (COMP_CFGR1_WINMODE) /* Bitfield to select window mode */
#define LL_COMP_WINDOW_OUT_SETTING_MASK (COMP_CFGR1_WINOUT) /* Bitfield to select window output */
#define LL_COMP_WINDOW_OUT_XOR_BOTH_MASK (COMP_CFGR1_WINOUT << 1UL) /* Differentiator of window output settings */
#else
#define LL_COMP_WINDOW_COMP_X_SETTING_MASK (COMP_CSR_INPSEL)  /* Bitfield to select window mode */
#define LL_COMP_WINDOW_OUT_SETTING_MASK (COMP_CSR_WINOUT) /* Bitfield to select window output */
#define LL_COMP_WINDOW_OUT_XOR_BOTH_MASK (COMP_CSR_WINOUT << 1UL) /* Differentiator of window output settings */
#endif /* COMP_CFGR1_WINMODE */

#define LL_COMP_WINDOW_OUT_XOR_BOTH_POS_VS_WINDOW (1UL) /* Bitfields position differences between
                                        LL_COMP_WINDOW_OUT_XOR_BOTH_MASK and LL_COMP_WINDOW_COMP_X_SETTING_MASK */

/* COMP instances relative position in COMP common instance */
#define LL_COMP_WINDOW_COMP_ODD         (LL_COMP_WINDOW_COMP_ODD_REGOFFSET_MASK)  /* Comparator instance odd
                                        (COMP1, ...) */
#define LL_COMP_WINDOW_COMP_EVEN        (LL_COMP_WINDOW_COMP_EVEN_REGOFFSET_MASK) /* Comparator instance even
                                        (COMP2, ...) */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup COMP_LL_Private_Macros COMP Private Macros
  * @{
  */

/**
  * @brief  Driver macro reserved for internal use: set a pointer to
  *         a register from a register basis from which an offset
  *         is applied.
  * @param  __REG__ Register basis from which the offset is applied.
  * @param  __REG_OFFFSET__ Offset to be applied (unit: number of registers).
  * @retval Pointer to register address.
  */
#define LL_COMP_PTR_REG_OFFSET(__REG__, __REG_OFFFSET__) \
  ((__IO uint32_t *)((uint32_t) ((uint32_t)(&(__REG__)) + ((__REG_OFFFSET__) << 2UL))))

/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup COMP_LL_Exported_Constants LL COMP Constants
  * @{
  */

#if defined(COMP_WINDOW_MODE_SUPPORT)
/** @defgroup COMP_LL_EC_COMMON_WINDOWMODE Comparator common modes - Window mode
  * @{
  */
#define LL_COMP_WINDOW_DISABLE          (0x00000000UL) /*!< Window mode disable: comparators pair are independent */
#if defined(COMP_CFGR1_WINMODE)
#define LL_COMP_WINDOW_INPUT_PLUS_ODD   (COMP_CFGR1_WINMODE | LL_COMP_WINDOW_COMP_EVEN_REGOFFSET_MASK) /*!< Window mode
                                        enable: comparators instances pair have their input plus connected together.
                                        The common input is the one of instance index odd (COMP1, ...).
                                        Input plus of the other comparator is no more accessible. */
#define LL_COMP_WINDOW_INPUT_PLUS_EVEN  (COMP_CFGR1_WINMODE | LL_COMP_WINDOW_COMP_ODD_REGOFFSET_MASK) /*!< Window mode
                                        enable: comparators instances pair have their input plus connected together.
                                        The common input is the one of instance index even (COMP2, ...).
                                        Input plus of the other comparator is no more accessible. */
#else
#define LL_COMP_WINDOW_INPUT_PLUS_ODD   (COMP_CSR_INPSEL_0 | COMP_CSR_INPSEL_1 | COMP_CSR_INPSEL_2 | \
                                         LL_COMP_WINDOW_COMP_EVEN_REGOFFSET_MASK) /*!< Window mode
                                        enable: comparators instances pair have their input plus connected together.
                                        The common input is the one of instance index odd (COMP1, ...).
                                        Input plus of the other comparator is no more accessible. */
#define LL_COMP_WINDOW_INPUT_PLUS_EVEN  (COMP_CSR_INPSEL_0 | COMP_CSR_INPSEL_1 | COMP_CSR_INPSEL_2 | \
                                         LL_COMP_WINDOW_COMP_ODD_REGOFFSET_MASK) /*!< Window mode
                                        enable: comparators instances pair have their input plus connected together.
                                        The common input is the one of instance index even (COMP2, ...).
                                        Input plus of the other comparator is no more accessible. */
#endif /* COMP_CFGR1_WINMODE */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_COMMON_WINDOWOUTPUT Comparator common modes - Window output
  * @{
  */
#define LL_COMP_WINDOW_OUTPUT_INDEPT    (0x00000000UL)/*!< Comparators window output default mode:
                                        both comparators output are independent, indicating each their own state.
                                        Note: To know signal state versus window thresholds, read each comparator
                                              output and perform a logical "exclusive or" operation. */
#if defined(COMP_CFGR1_WINMODE)
#define LL_COMP_WINDOW_OUTPUT_XOR_ODD   (COMP_CFGR1_WINOUT | LL_COMP_WINDOW_COMP_ODD_REGOFFSET_MASK)  /*!< Window output
                                        synthesized on COMP1 output: COMP1 output is no more indicating its own state,
                                        but global window mode state. Logical high means monitored signal is within
                                        comparators window.
                                        Note: impacts only comparator output signal level (propagated to GPIO, EXTI
                                              lines, timers, ...), does not impact output digital state
                                              (@ref LL_COMP_ReadOutputLevel()) always reflecting each comparator
                                              output state.*/
#define LL_COMP_WINDOW_OUTPUT_XOR_EVEN  (COMP_CFGR1_WINOUT | LL_COMP_WINDOW_COMP_EVEN_REGOFFSET_MASK) /*!< Window output
                                        synthesized on COMP2 output: COMP2 output is no more indicating its own state,
                                        but global window mode state. Logical high means monitored signal is within
                                        comparators window.
                                        Note: impacts only comparator output signal level (propagated to GPIO, EXTI
                                              lines, timers, ...), does not impact output digital state
                                              (@ref LL_COMP_ReadOutputLevel()) always reflecting each comparator
                                              output state.*/
#define LL_COMP_WINDOW_OUTPUT_XOR_BOTH  (COMP_CFGR1_WINOUT | LL_COMP_WINDOW_COMP_EVEN_REGOFFSET_MASK \
                                         | LL_COMP_WINDOW_OUT_XOR_BOTH_MASK) /*!< Window output synthesized on both
                                        comparators output of pair of comparator selected (COMP1 and COMP2):
                                        both comparators outputs are no more indicating their own state, but global
                                        window mode state (XOR: logical "exclusive or"). Logical high means monitored
                                        signal is within comparators window thresholds).
                                        This is a specific configuration (technically possible but not relevant from
                                        application point of view: 2 comparators output used for the same signal level),
                                        standard configuration for window mode is one of the settings above.
                                        Note: impacts only comparator output signal level (propagated to GPIO, EXTI
                                              lines, timers, ...), does not impact output digital state
                                              (@ref LL_COMP_ReadOutputLevel()) always reflecting each comparator
                                              output state.*/
#else
#define LL_COMP_WINDOW_OUTPUT_XOR_ODD   (COMP_CSR_WINOUT | LL_COMP_WINDOW_COMP_ODD_REGOFFSET_MASK)  /*!< Window output
                                        synthesized on COMP1 output: COMP1 output is no more indicating its own state,
                                        but global window mode state. Logical high means monitored signal is within
                                        comparators window.
                                        Note: impacts only comparator output signal level (propagated to GPIO, EXTI
                                              lines, timers, ...), does not impact output digital state
                                              (@ref LL_COMP_ReadOutputLevel()) always reflecting each comparator
                                              output state.*/
#define LL_COMP_WINDOW_OUTPUT_XOR_EVEN  (COMP_CSR_WINOUT | LL_COMP_WINDOW_COMP_EVEN_REGOFFSET_MASK) /*!< Window output
                                        synthesized on COMP2 output: COMP2 output is no more indicating its own state,
                                        but global window mode state. Logical high means monitored signal is within
                                        comparators window.
                                        Note: impacts only comparator output signal level (propagated to GPIO, EXTI
                                              lines, timers, ...), does not impact output digital state
                                              (@ref LL_COMP_ReadOutputLevel()) always reflecting each comparator
                                              output state.*/
#define LL_COMP_WINDOW_OUTPUT_XOR_BOTH  (COMP_CSR_WINOUT | LL_COMP_WINDOW_COMP_EVEN_REGOFFSET_MASK \
                                         | LL_COMP_WINDOW_OUT_XOR_BOTH_MASK) /*!< Window output synthesized on both
                                        comparators output of pair of comparator selected (COMP1 and COMP2):
                                        both comparators outputs are no more indicating their own state, but global
                                        window mode state (XOR: logical "exclusive or"). Logical high means monitored
                                        signal is within comparators window thresholds).
                                        This is a specific configuration (technically possible but not relevant from
                                        application point of view: 2 comparators output used for the same signal level),
                                        standard configuration for window mode is one of the settings above.
                                        Note: impacts only comparator output signal level (propagated to GPIO, EXTI
                                              lines, timers, ...), does not impact output digital state
                                              (@ref LL_COMP_ReadOutputLevel()) always reflecting each comparator
                                              output state.*/
#endif /* COMP_CFGR1_WINMODE */
/**
  * @}
  */

#endif /* COMP_WINDOW_MODE_SUPPORT */
/** @defgroup COMP_LL_EC_POWER_MODE Comparator modes - Power mode
  * @{
  */
#define LL_COMP_POWER_MODE_HIGH_SPEED   (0x00000000UL)         /*!< Comparator power mode to high speed */
#define LL_COMP_POWER_MODE_MEDIUM_SPEED (COMP_CFGR1_PWRMODE_0) /*!< Comparator power mode to medium speed */
#define LL_COMP_POWER_MODE_ULTRA_LOW_POWER (COMP_CFGR1_PWRMODE_1 \
                                            | COMP_CFGR1_PWRMODE_0) /*!< Comparator power mode to ultra-low power */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_POWER_MODE_LEGACY Comparator modes - Power mode legacy definitions
  * @{
  */
#define LL_COMP_POWERMODE_HIGHSPEED     LL_COMP_POWER_MODE_HIGH_SPEED
#define LL_COMP_POWERMODE_MEDIUMSPEED   LL_COMP_POWER_MODE_MEDIUM_SPEED
#define LL_COMP_POWERMODE_ULTRALOWPOWER LL_COMP_POWER_MODE_ULTRA_LOW_POWER
/**
  * @}
  */

