MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_comp.h
/** @defgroup COMP_LL_EC_INPUT_PLUS Comparator inputs - Input plus (input non-inverting) selection
  * @{
  */
#define LL_COMP_INPUT_PLUS_IO1          (0x00000000UL)       /*!< Comparator input plus connected to IO1
                                        (for GPIO mapping, refer to the datasheet parameters "COMPx_INP1"). */
#define LL_COMP_INPUT_PLUS_IO2          (COMP_CFGR1_INPSEL_0) /*!< Comparator input plus connected to IO2
                                        (for GPIO mapping, refer to the datasheet parameters "COMPx_INP2"). */
#define LL_COMP_INPUT_PLUS_IO3          (COMP_CFGR1_INPSEL_1) /*!< Comparator input plus connected to IO3
                                        (for GPIO mapping, refer to the datasheet parameters "COMPx_INP3"). */
#define LL_COMP_INPUT_PLUS_DAC1_CH1     (COMP_CFGR1_INPSEL_1 | COMP_CFGR1_INPSEL_0) /*!< Comparator input plus
                                        connected to DAC1 channel 1.
                                        Specific to COMP instance: COMP1. */
#if defined(COMP2)
#define LL_COMP_INPUT_PLUS_DAC1_CH2     (COMP_CFGR1_INPSEL_1 | COMP_CFGR1_INPSEL_0) /*!< Comparator input plus
                                        connected to DAC1 channel 2.
                                        Specific to COMP instance: COMP2 (available on devices STM32C53xx/54xx). */
#endif /* COMP2 */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_INPUT_MINUS Comparator inputs - Input minus (input inverting) selection
  * @{
  */
#define LL_COMP_INPUT_MINUS_VREFINT     (COMP_CFGR1_INMSEL_1 | COMP_CFGR1_INMSEL_0 \
                                         | COMP_CFGR1_SCALEN) /*!< Comparator input minus connected to VrefInt
                                        (for VrefInt voltage value, refer to the datasheet). */
#define LL_COMP_INPUT_MINUS_1_4VREFINT  (COMP_CFGR1_SCALEN | COMP_CFGR1_BRGEN) /*!< Comparator input minus connected
                                        to 1/4 VrefInt (for VrefInt voltage value, refer to the datasheet). */
#define LL_COMP_INPUT_MINUS_1_2VREFINT  (COMP_CFGR1_INMSEL_0 | COMP_CFGR1_SCALEN | COMP_CFGR1_BRGEN) /*!< Comparator
                                        input minus connected to 1/2 VrefInt (for VrefInt voltage value, refer to
                                        the datasheet). */
#define LL_COMP_INPUT_MINUS_3_4VREFINT  (COMP_CFGR1_INMSEL_1 | COMP_CFGR1_SCALEN | COMP_CFGR1_BRGEN) /*!< Comparator
                                        input minus connected to 3/4 VrefInt (for VrefInt voltage value, refer to
                                        the datasheet). */
#define LL_COMP_INPUT_MINUS_IO1         (COMP_CFGR1_INMSEL_2 | COMP_CFGR1_INMSEL_0) /*!< Comparator
                                        input minus connected to IO1 (for GPIO mapping, refer to the datasheet
                                        parameters "COMPx_INM1"). */
#define LL_COMP_INPUT_MINUS_IO2         (COMP_CFGR1_INMSEL_2 | COMP_CFGR1_INMSEL_1) /*!< Comparator
                                        input minus connected to IO2 (for GPIO mapping, refer to the datasheet
                                        parameters "COMPx_INM2"). */
#define LL_COMP_INPUT_MINUS_IO3         (COMP_CFGR1_INMSEL_2 | COMP_CFGR1_INMSEL_1 \
                                         | COMP_CFGR1_INMSEL_0) /*!< Comparator input minus connected to IO3
                                        (for GPIO mapping, refer to the datasheet parameters "COMPx_INM3"). */
#define LL_COMP_INPUT_MINUS_DAC1_CH1    (COMP_CFGR1_INMSEL_2) /*!< Comparator input minus connected
                                        to DAC1 channel 1.
                                        Specific to COMP instances: COMP1. */
#if defined(COMP2)
#define LL_COMP_INPUT_MINUS_DAC1_CH2    (COMP_CFGR1_INMSEL_2) /*!< Comparator input minus connected
                                        to DAC1 channel 2.
                                        Specific to COMP instance: COMP2 (available on devices STM32C53xx/54xx). */
#define LL_COMP_INPUT_MINUS_OPAMP1_OUT  (COMP_CFGR1_INMSEL_3) /*!< Comparator input minus connected
                                        to OPAMP1 output.
                                        Specific to COMP instance: COMP2 (available on devices STM32C53xx/54xx). */
#endif /* COMP2 */
#define LL_COMP_INPUT_MINUS_TEMPSENSOR  (COMP_CFGR1_INMSEL_3) /*!< Comparator input minus connected
                                        to the internal temperature sensor (also accessible through the ADC
                                        peripheral).
                                        Call function @ref LL_COMP_EnableInputTempSensorBuffer(). */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_INPUT_HYSTERESIS Comparator input - Hysteresis
  * @{
  */
#define LL_COMP_HYSTERESIS_NONE         (0x00000000UL)                          /*!< No hysteresis */
#define LL_COMP_HYSTERESIS_LOW          (COMP_CFGR1_HYST_0)                     /*!< Hysteresis level low */
#define LL_COMP_HYSTERESIS_MEDIUM       (COMP_CFGR1_HYST_1)                     /*!< Hysteresis level medium */
#define LL_COMP_HYSTERESIS_HIGH         (COMP_CFGR1_HYST_1 | COMP_CFGR1_HYST_0) /*!< Hysteresis level high */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_OUTPUT_POLARITY Comparator output - Output polarity
  * @{
  */
#define LL_COMP_OUTPUTPOL_NONINVERTED   (0x00000000UL) /*!< Comparator output polarity not inverted:
                                        comparator output at high level when input voltages: plus higher than minus */
#define LL_COMP_OUTPUTPOL_INVERTED      (COMP_CFGR1_POLARITY) /*!< Comparator output polarity not inverted:
                                        comparator output at low level when input voltages: plus higher than minus */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_OUTPUT_BLANKING_SOURCE Comparator output - Blanking source
  * @{
  */
#define LL_COMP_BLANKINGSRC_NONE        (0x00000000UL)        /*!< Comparator output without blanking */
#define LL_COMP_BLANKINGSRC_TIM1_OC5    (COMP_CFGR1_BLANKING_0)   /*!< Comparator output blanking source TIM1 OC5,
                                        specific to instance: COMP1. */
#define LL_COMP_BLANKINGSRC_TIM1_OC6    (COMP_CFGR1_BLANKING_0)   /*!< Comparator output blanking source TIM1 OC6,
                                        specific to instance: COMP2. */
#define LL_COMP_BLANKINGSRC_TIM2_OC3    (COMP_CFGR1_BLANKING_1)   /*!< Comparator output blanking source TIM2 OC3. */
#define LL_COMP_BLANKINGSRC_TIM5_OC3    (COMP_CFGR1_BLANKING_0 \
                                         | COMP_CFGR1_BLANKING_1) /*!< Comparator output blanking source TIM5 OC3. */
#define LL_COMP_BLANKINGSRC_TIM5_OC4    (COMP_CFGR1_BLANKING_2)   /*!< Comparator output blanking source TIM5 OC4. */
#define LL_COMP_BLANKINGSRC_TIM8_OC5    (COMP_CFGR1_BLANKING_2 \
                                         | COMP_CFGR1_BLANKING_0) /*!< Comparator output blanking source TIM8 OC5. */
#define LL_COMP_BLANKINGSRC_TIM15_OC2   (COMP_CFGR1_BLANKING_2 \
                                         | COMP_CFGR1_BLANKING_1) /*!< Comparator output blanking source TIM15 OC2. */
#define LL_COMP_BLANKINGSRC_LPTIM1_OC1  (COMP_CFGR1_BLANKING_2 \
                                         | COMP_CFGR1_BLANKING_1 \
                                         | COMP_CFGR1_BLANKING_0) /*!< Comparator output blanking source LPTIM1 OC1,
                                        specific to instance: COMP2. */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_OUTPUT_LEVEL Comparator output - Output level
  * @{
  */
#define LL_COMP_OUTPUT_LEVEL_LOW        (0x00000000UL) /*!< Comparator output level low (with polarity not inverted) */
#define LL_COMP_OUTPUT_LEVEL_HIGH       (0x00000001UL) /*!< Comparator output level high (with polarity not inverted) */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_HW_DELAYS  Definitions of COMP hardware constraints delays
  * @note   Only COMP peripheral HW delays are defined in COMP LL driver driver, not timeout values.
  * @{
  */

