MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_comp.h
/* Delay for comparator startup time.                                         */
/* Note: Delay required to reach propagation delay specification.             */
/* Literal set to maximum value (refer to device datasheet,                   */
/* parameter "tSTART").                                                       */
/* Unit: us                                                                   */
#define LL_COMP_DELAY_STARTUP_US        (80UL) /*!< Delay for comparator startup time.
                                        Delay set to maximum value (refer to device datasheet, parameter "tSTART").
                                        Unit: us.
                                        Note: At comparator enable, delay required to reach propagation delay
                                              specification. */

/* Delay for comparator voltage scaler stabilization time.                    */
/* Note: Voltage scaler is used when selecting comparator input               */
/*       based on VrefInt (VrefInt or subdivision of VrefInt).                */
/* Note: To get scaler bridge configuration,                                  */
/*       refer to @ref LL_COMP_IsInputScalerEnabled().                        */
/* Literal set to maximum value (refer to device datasheet,                   */
/* parameter "tSTART_SCALER").                                                */
/* Unit: us                                                                   */
#define LL_COMP_DELAY_VOLTAGE_SCALER_STAB_US (220UL) /*!< Delay for comparator voltage scaler stabilization time
                                        Delay set to maximum value (refer to device datasheet,
                                        parameter "tSTART_SCALER").
                                        Unit: us.
                                        Note: Voltage scaler is used when selecting comparator input
                                              based on VrefInt (VrefInt or subdivision of VrefInt).
                                        Note: To get scaler bridge configuration,
                                              refer to @ref LL_COMP_IsInputScalerEnabled().
                                        */

/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup COMP_LL_Exported_Macros LL COMP Macros
  * @{
  */
/** @defgroup COMP_LL_EM_WRITE_READ Common write and read registers macro
  * @{
  */

/**
  * @brief  Write a value in COMP register.
  * @param  __INSTANCE__ comparator instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  */
#define LL_COMP_WRITE_REG(__INSTANCE__, __REG__, __VALUE__) STM32_WRITE_REG((__INSTANCE__)->__REG__, (__VALUE__))

/**
  * @brief  Read a value in COMP register.
  * @param  __INSTANCE__ comparator instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_COMP_READ_REG(__INSTANCE__, __REG__) STM32_READ_REG((__INSTANCE__)->__REG__)
/**
  * @}
  */

/** @defgroup COMP_LL_EM_HELPER_MACRO COMP helper macro
  * @{
  */

/**
  * @brief  Helper macro to select the COMP common instance
  *         to which is belonging the selected COMP instance.
  * @param  instance COMP instance
  * @note   COMP common register instance can be used to
  *         set parameters common to several COMP instances.
  *         Refer to functions having argument "p_comp_common" as parameter.
  * @retval COMP common instance or value "0" if there is no COMP common instance.
  */
#define LL_COMP_COMMON_INSTANCE(instance) (COMP12_COMMON)

/**
  * @brief  Helper macro to define comparator instance position generic identification (odd or even)
  *         from comparator instance.
  * @param  instance Comparator instance.
  * @retval Comparator common instance or value "0" if there is no COMP common instance.
  */
#define LL_COMP_WINDOW_INST_POS_ID(instance)                                   \
  ((((instance) == COMP1))                                                     \
   ? ((LL_COMP_WINDOW_COMP_ODD))                                               \
   :                                                                           \
   ((LL_COMP_WINDOW_COMP_EVEN))                                                \
  )

/**
  * @brief  Helper macro to select literal LL_COMP_WINDOW_INPUT_PLUS_x with suffix odd or even
  *         from comparator instance.
  * @param  instance COMP instance.
  * @note   Helper macro intended to be used with function LL_COMP_SetCommonWindowMode()
  * @retval COMP common instance or value "0" if there is no COMP common instance.
  */
#define LL_COMP_WINDOW_INST_TO_INPUT_PLUS(instance)                           \
  (((LL_COMP_WINDOW_INST_POS_ID(instance) == LL_COMP_WINDOW_COMP_ODD))        \
   ? ((LL_COMP_WINDOW_INPUT_PLUS_ODD))                                        \
   :                                                                          \
   ((LL_COMP_WINDOW_INPUT_PLUS_EVEN))                                         \
  )

/**
  * @brief  Helper macro to select literal LL_COMP_WINDOW_OUTPUT_x with suffix odd or even
  *         from comparator instance.
  * @param  instance COMP instance.
  * @note   Helper macro intended to be used with function LL_COMP_SetCommonWindowOutput()
  * @retval COMP common instance or value "0" if there is no COMP common instance.
  */
#define LL_COMP_WINDOW_INST_TO_OUTPUT(instance)                               \
  (((LL_COMP_WINDOW_INST_POS_ID(instance) == LL_COMP_WINDOW_COMP_ODD))        \
   ? ((LL_COMP_WINDOW_OUTPUT_XOR_ODD))                                        \
   :                                                                          \
   ((LL_COMP_WINDOW_OUTPUT_XOR_EVEN))                                         \
  )
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup COMP_LL_Exported_Functions LL COMP Functions
  * @{
  */

#if defined(COMP_WINDOW_MODE_SUPPORT)
/** @defgroup COMP_LL_EF_Configuration_comparator_common Configuration of COMP hierarchical scope:
  *           common to several COMP instances
  * @{
  */

/**
  * @brief  Set window mode of a pair of comparators instances
  *         (2 consecutive COMP instances COMP<x> and COMP<x+1>).
  * @rmtoll
  *  CFGR1    WINMODE        LL_COMP_SetCommonWindowMode
  * @param  p_comp_common Comparator common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref LL_COMP_COMMON_INSTANCE() )
  * @param  window_mode This parameter can be one of the following values:
  *         @arg @ref LL_COMP_WINDOW_DISABLE
  *         @arg @ref LL_COMP_WINDOW_INPUT_PLUS_ODD
  *         @arg @ref LL_COMP_WINDOW_INPUT_PLUS_EVEN
  *         Note: Parameters values with suffix odd or even can also be selected from comparator instance
  *               using helper macro LL_COMP_WINDOW_INST_TO_INPUT_PLUS.
  */
__STATIC_INLINE void LL_COMP_SetCommonWindowMode(COMP_Common_TypeDef *p_comp_common, uint32_t window_mode)
{
  /* Note: On this STM32 series, window mode can be set from any instance     */
  /*       of the pair of comparator instances.                               */

#if defined(COMP_CFGR1_WINMODE)
  __IO uint32_t *preg = LL_COMP_PTR_REG_OFFSET(p_comp_common->CFGR1,
                                               (window_mode & LL_COMP_WINDOW_COMP_REGOFFSET_MASK));

