MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_comp.h
  /* Clear the potential previous setting of window mode */
  __IO uint32_t *preg_clear = LL_COMP_PTR_REG_OFFSET(p_comp_common->CFGR1,
                                                     (~(window_mode & LL_COMP_WINDOW_COMP_REGOFFSET_MASK) & 0x1UL)
                                                    );
  STM32_CLEAR_BIT(*preg_clear, COMP_CFGR1_WINMODE);

  /* Set window mode */
  STM32_MODIFY_REG(*preg, COMP_CFGR1_WINMODE, (window_mode & LL_COMP_WINDOW_COMP_X_SETTING_MASK));
#else
  __IO uint32_t *preg = LL_COMP_PTR_REG_OFFSET(p_comp_common->CSR_ODD,
                                               (window_mode & LL_COMP_WINDOW_COMP_REGOFFSET_MASK));

  /* Set window mode */
  STM32_MODIFY_REG(*preg, COMP_CSR_INPSEL, (window_mode & LL_COMP_WINDOW_COMP_X_SETTING_MASK));
#endif /* COMP_CFGR1_WINMODE */

}

/**
  * @brief  Get window mode of a pair of comparators instances
  *         (2 consecutive COMP instances COMP<x> and COMP<x+1>).
  * @rmtoll
  *  CFGR1    WINMODE        LL_COMP_GetCommonWindowMode
  * @param  p_comp_common Comparator common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref LL_COMP_COMMON_INSTANCE() ).
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_COMP_WINDOW_DISABLE
  *         @arg @ref LL_COMP_WINDOW_INPUT_PLUS_ODD
  *         @arg @ref LL_COMP_WINDOW_INPUT_PLUS_EVEN
  */
__STATIC_INLINE uint32_t LL_COMP_GetCommonWindowMode(const COMP_Common_TypeDef *p_comp_common)
{
  /* Note: On this STM32 series, window mode can be set from any instance      */
  /*       of the pair of comparator instances.                               */

#if defined(COMP_CFGR1_WINMODE)
  const uint32_t window_mode_comp_odd = (uint32_t)STM32_READ_BIT(p_comp_common->CFGR1, COMP_CFGR1_WINMODE);
  const uint32_t window_mode_comp_even = (uint32_t)STM32_READ_BIT(p_comp_common->CFGR2, COMP_CFGR1_WINMODE);

  return (uint32_t)(window_mode_comp_odd
                    | window_mode_comp_even
                    | (window_mode_comp_even >> COMP_CFGR1_WINMODE_Pos)
                   );
#else
  const uint32_t window_mode_comp_odd = (uint32_t)STM32_READ_BIT(p_comp_common->CSR_ODD, COMP_CSR_INPSEL);
  const uint32_t window_mode_comp_even = (uint32_t)STM32_READ_BIT(p_comp_common->CSR_EVEN, COMP_CSR_INPSEL);

  return (uint32_t)(window_mode_comp_odd
                    | window_mode_comp_even
                    | ((window_mode_comp_even >> COMP_CSR_INPSEL_Pos) & LL_COMP_WINDOW_COMP_EVEN_REGOFFSET_MASK)
                   );
#endif /* COMP_CFGR1_WINMODE */
}

/**
  * @brief  Set window output of a pair of comparators instances
  *         (2 consecutive COMP instances COMP<x> and COMP<x+1>).
  * @rmtoll
  *  CFGR1    WINOUT         LL_COMP_SetCommonWindowOutput
  * @param  p_comp_common Comparator common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref LL_COMP_COMMON_INSTANCE() ).
  * @param  window_output This parameter can be one of the following values:
  *         @arg @ref LL_COMP_WINDOW_OUTPUT_INDEPT
  *         @arg @ref LL_COMP_WINDOW_OUTPUT_XOR_ODD
  *         @arg @ref LL_COMP_WINDOW_OUTPUT_XOR_EVEN
  *         @arg @ref LL_COMP_WINDOW_OUTPUT_XOR_BOTH
  *         Note: Parameters values with suffix odd or even can also be selected from comparator instance
  *               using helper LL_COMP_WINDOW_INST_TO_OUTPUT.
  */
__STATIC_INLINE void LL_COMP_SetCommonWindowOutput(COMP_Common_TypeDef *p_comp_common, uint32_t window_output)
{
#if defined(COMP_CFGR1_WINMODE)
  __IO uint32_t *preg = LL_COMP_PTR_REG_OFFSET(p_comp_common->CFGR1,
                                               (window_output & LL_COMP_WINDOW_COMP_REGOFFSET_MASK));

  /* Clear the potential previous setting of window output on the relevant comparator instance */
  /* (clear bit of window output unless specific case of setting of comparator both output selected) */
  __IO uint32_t *preg_clear = LL_COMP_PTR_REG_OFFSET(p_comp_common->CFGR1,
                                                     (~(window_output & LL_COMP_WINDOW_COMP_REGOFFSET_MASK) & 0x1UL)
                                                    );
  STM32_MODIFY_REG(*preg_clear,
                   COMP_CFGR1_WINOUT,
                   ((window_output & LL_COMP_WINDOW_OUT_XOR_BOTH_MASK)
                    >> LL_COMP_WINDOW_OUT_XOR_BOTH_POS_VS_WINDOW)
                  );

  /* Set window output */
  STM32_MODIFY_REG(*preg,
                   COMP_CFGR1_WINOUT,
                   (window_output & LL_COMP_WINDOW_OUT_SETTING_MASK)
                  );
#else
  /* Note: On this STM32 series, window mode can be set from any instance     */
  /*       of the pair of comparator instances.                               */

  __IO uint32_t *preg = LL_COMP_PTR_REG_OFFSET(p_comp_common->CSR_ODD,
                                               (window_output & LL_COMP_WINDOW_COMP_REGOFFSET_MASK));

  /* Clear the potential previous setting of window output on the relevant comparator instance */
  /* (clear bit of window output unless specific case of setting of comparator both output selected) */
  __IO uint32_t *preg_clear = LL_COMP_PTR_REG_OFFSET(p_comp_common->CSR_ODD,
                                                     ((~(window_output & LL_COMP_WINDOW_COMP_REGOFFSET_MASK)
                                                       & 0x1UL))
                                                    );
  STM32_MODIFY_REG(*preg_clear,
                   COMP_CSR_WINOUT,
                   ((window_output & LL_COMP_WINDOW_OUT_XOR_BOTH_MASK)
                    >> LL_COMP_WINDOW_OUT_XOR_BOTH_POS_VS_WINDOW)
                  );

  /* Set window output */
  STM32_MODIFY_REG(*preg,
                   COMP_CSR_WINOUT,
                   (window_output & LL_COMP_WINDOW_OUT_SETTING_MASK)
                  );
#endif /* COMP_CFGR1_WINMODE */
}

/**
  * @brief  Get window output of a pair of comparators instances
  *         (2 consecutive COMP instances COMP<x> and COMP<x+1>).
  * @rmtoll
  *  CFGR1    WINOUT         LL_COMP_GetCommonWindowOutput
  * @param  p_comp_common Comparator common instance
  *         (can be set directly from CMSIS definition or by using helper macro @ref LL_COMP_COMMON_INSTANCE() ).
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_COMP_WINDOW_OUTPUT_INDEPT
  *         @arg @ref LL_COMP_WINDOW_OUTPUT_XOR_ODD
  *         @arg @ref LL_COMP_WINDOW_OUTPUT_XOR_EVEN
  *         @arg @ref LL_COMP_WINDOW_OUTPUT_XOR_BOTH
  */
__STATIC_INLINE uint32_t LL_COMP_GetCommonWindowOutput(const COMP_Common_TypeDef *p_comp_common)
{
#if defined(COMP_CFGR1_WINMODE)
  const uint32_t window_output_comp_odd = (uint32_t)STM32_READ_BIT(p_comp_common->CFGR1, COMP_CFGR1_WINOUT);
  const uint32_t window_output_comp_even = (uint32_t)STM32_READ_BIT(p_comp_common->CFGR2, COMP_CFGR1_WINOUT);

