MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_comp.h
  /* Construct value corresponding to LL_COMP_WINDOWOUTPUT_xxx */
  return (uint32_t)(window_output_comp_odd
                    | window_output_comp_even
                    | ((window_output_comp_even >> COMP_CFGR1_WINOUT_Pos) * LL_COMP_WINDOW_COMP_EVEN_REGOFFSET_MASK)
                    | (window_output_comp_odd + window_output_comp_even));

#else
  const uint32_t window_output_comp_odd = (uint32_t)STM32_READ_BIT(p_comp_common->CSR_ODD, COMP_CSR_WINOUT);
  const uint32_t window_output_comp_even = (uint32_t)STM32_READ_BIT(p_comp_common->CSR_EVEN, COMP_CSR_WINOUT);

  /* Construct value corresponding to LL_COMP_WINDOWOUTPUT_xxx */
  return (uint32_t)(window_output_comp_odd
                    | window_output_comp_even
                    | ((window_output_comp_even >> COMP_CSR_WINOUT_Pos) * LL_COMP_WINDOW_COMP_EVEN_REGOFFSET_MASK)
                    | (window_output_comp_odd + window_output_comp_even));
#endif /* COMP_CFGR1_WINMODE */
}
/**
  * @}
  */

#endif /* COMP_WINDOW_MODE_SUPPORT */

/** @defgroup COMP_LL_EF_Configuration_comparator_modes Configuration of comparator modes
  * @{
  */

/**
  * @brief  Set comparator instance operating mode to adjust power and speed.
  * @rmtoll
  *  CFGR1    PWRMODE        LL_COMP_SetPowerMode
  * @param  p_comp Comparator instance.
  * @param  power_mode This parameter can be one of the following values:
  *         @arg @ref LL_COMP_POWER_MODE_HIGH_SPEED
  *         @arg @ref LL_COMP_POWER_MODE_MEDIUM_SPEED
  *         @arg @ref LL_COMP_POWER_MODE_ULTRA_LOW_POWER
  */
__STATIC_INLINE void LL_COMP_SetPowerMode(COMP_TypeDef *p_comp, uint32_t power_mode)
{
  STM32_MODIFY_REG(LL_COMP_REG(p_comp), COMP_CFGR1_PWRMODE, power_mode);
}

/**
  * @brief  Get comparator instance operating mode to adjust power and speed.
  * @rmtoll
  *  CFGR1    PWRMODE        LL_COMP_GetPowerMode
  * @param  p_comp Comparator instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_COMP_POWER_MODE_HIGH_SPEED
  *         @arg @ref LL_COMP_POWER_MODE_MEDIUM_SPEED
  *         @arg @ref LL_COMP_POWER_MODE_ULTRA_LOW_POWER
  */
__STATIC_INLINE uint32_t LL_COMP_GetPowerMode(const COMP_TypeDef *p_comp)
{
  return (uint32_t)(STM32_READ_BIT(LL_COMP_REG(p_comp), COMP_CFGR1_PWRMODE));
}

/**
  * @}
  */

/** @defgroup COMP_LL_EF_Configuration_comparator_inputs Configuration of comparator inputs
  * @{
  */

/**
  * @brief  Set comparator inputs minus (inverting) and plus (non-inverting).
  * @rmtoll
  *  CFGR1    INPSEL         LL_COMP_ConfigInputs \n
  *  CFGR1    INMSEL         LL_COMP_ConfigInputs \n
  *  CFGR1    BRGEN          LL_COMP_ConfigInputs \n
  *  CFGR1    SCALEN         LL_COMP_ConfigInputs
  * @param  p_comp Comparator instance
  * @param  input_minus This parameter can be one of the following values:
  *         @arg @ref LL_COMP_INPUT_MINUS_1_4VREFINT
  *         @arg @ref LL_COMP_INPUT_MINUS_1_2VREFINT
  *         @arg @ref LL_COMP_INPUT_MINUS_3_4VREFINT
  *         @arg @ref LL_COMP_INPUT_MINUS_VREFINT
  *         @arg @ref LL_COMP_INPUT_MINUS_IO1
  *         @arg @ref LL_COMP_INPUT_MINUS_IO2
  *         @arg @ref LL_COMP_INPUT_MINUS_IO3
  * @if COMP1
  *         @arg @ref LL_COMP_INPUT_MINUS_DAC1_CH1   (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_TEMPSENSOR (1)
  * @endif
  * @if COMP2
  *         @arg @ref LL_COMP_INPUT_MINUS_DAC1_CH2   (2)
  *         @arg @ref LL_COMP_INPUT_MINUS_OPAMP1_OUT (2)
  * @endif
  *         @arg @ref LL_COMP_INPUT_MINUS_DAC2_CH1 (3)
  *         @arg @ref LL_COMP_INPUT_MINUS_DAC2_CH2 (3)(4)
  *
  *         (1) Specific to COMP instance: COMP1
  *         (2) Specific to COMP instance: COMP2 (available on devices STM32C53xx/54xx)
  *         (3) Parameters only available on STM32C5J1xx/5K1xx devices
  *         (4) Parameters only available on STM32C5P1xx/5Q1xx devices

  * @param  input_plus This parameter can be one of the following values:
  *         @arg @ref LL_COMP_INPUT_PLUS_IO1
  *         @arg @ref LL_COMP_INPUT_PLUS_IO2
  *         @arg @ref LL_COMP_INPUT_PLUS_IO3
  * @if COMP1
  *         @arg @ref LL_COMP_INPUT_PLUS_DAC1_CH1 (1)
  * @endif
  * @if COMP2
  *         @arg @ref LL_COMP_INPUT_PLUS_DAC1_CH2 (2)
  * @endif
  *         @arg @ref LL_COMP_INPUT_PLUS_OPAMP1_OUT (3)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_OPAMP2_OUT (3)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_OPAMP3_OUT (3)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_DAC2_CH1 (3)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_DAC2_CH2 (4)
  *
  *         (1) Specific to COMP instance: COMP1
  *         (2) Specific to COMP instance: COMP2 (available on devices STM32C53xx/54xx)
  *         (3) Parameters only available on STM32C5J1xx/5K1xx devices
  *         (4) Parameters only available on STM32C5P1xx/5Q1xx devices

  * @note   In case of comparator input selected to be connected to IO:
  *         GPIO pins are specific to each comparator instance.
  *         Refer to description of parameters or to reference manual.
  * @note   Voltage scaler is used when selecting comparator input based on VrefInt (VrefInt or subdivision of VrefInt).
  *         In this case, specific delay must be fulfilled for voltage stabilization when enabling comparator,
  *         refer to LL_COMP_DELAY_VOLTAGE_SCALER_STAB_US.
  * @note   On this STM32 series, a voltage scaler is used
  *         when COMP input is based on VrefInt (VrefInt or subdivision
  *         of VrefInt):
  *         Voltage scaler requires a delay for voltage stabilization.
  *         Refer to device datasheet, parameter "tSTART_SCALER".
  */
__STATIC_INLINE void LL_COMP_ConfigInputs(COMP_TypeDef *p_comp, uint32_t input_minus, uint32_t input_plus)
{
  STM32_MODIFY_REG(LL_COMP_REG(p_comp),
                   COMP_CFGR1_INMSEL | COMP_CFGR1_INPSEL | COMP_CFGR1_SCALEN | COMP_CFGR1_BRGEN,
                   input_minus | input_plus);
}

/**
  * @brief  Set comparator input plus.
  * @rmtoll
  *  CFGR1    INPSEL         LL_COMP_SetInputPlus
  * @param  p_comp Comparator instance
  * @param  input_plus This parameter can be one of the following values:
  *         @arg @ref LL_COMP_INPUT_PLUS_IO1
  *         @arg @ref LL_COMP_INPUT_PLUS_IO2
  *         @arg @ref LL_COMP_INPUT_PLUS_IO3
  * @if COMP1
  *         @arg @ref LL_COMP_INPUT_PLUS_DAC1_CH1 (1)
  * @endif
  * @if COMP2
  *         @arg @ref LL_COMP_INPUT_PLUS_DAC1_CH2 (2)
  * @endif
  *         @arg @ref LL_COMP_INPUT_PLUS_OPAMP1_OUT (3)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_OPAMP2_OUT (3)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_OPAMP3_OUT (3)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_DAC2_CH1 (3)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_DAC2_CH2 (4)
  *
  *         (1) Specific to COMP instance: COMP1
  *         (2) Specific to COMP instance: COMP2 (available on devices STM32C53xx/54xx)
  *         (3) Parameters only available on STM32C5J1xx/5K1xx devices
  *         (4) Parameters only available on STM32C5P1xx/5Q1xx devices

