MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_comp.h
  * @note   In case of comparator input selected to be connected to IO:
  *         GPIO pins are specific to each comparator instance.
  *         Refer to description of parameters or to reference manual.
  */
__STATIC_INLINE void LL_COMP_SetInputPlus(COMP_TypeDef *p_comp, uint32_t input_plus)
{
  STM32_MODIFY_REG(LL_COMP_REG(p_comp), COMP_CFGR1_INPSEL, input_plus);
}

/**
  * @brief  Get comparator input plus.
  * @rmtoll
  *  CFGR1    INPSEL         LL_COMP_GetInputPlus
  * @param  p_comp Comparator instance
  * @note   In case of comparator input selected to be connected to IO:
  *         GPIO pins are specific to each comparator instance.
  *         Refer to description of parameters or to reference manual.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_COMP_INPUT_PLUS_IO1
  *         @arg @ref LL_COMP_INPUT_PLUS_IO2
  *         @arg @ref LL_COMP_INPUT_PLUS_IO3
  * @if COMP1
  *         @arg @ref LL_COMP_INPUT_PLUS_DAC1_CH1 (1)
  * @endif
  * @if COMP2
  *         @arg @ref LL_COMP_INPUT_PLUS_DAC1_CH2 (2)
  * @endif
  *         @arg @ref LL_COMP_INPUT_PLUS_OPAMP1_OUT (3)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_OPAMP2_OUT (3)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_OPAMP3_OUT (3)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_DAC2_CH1 (3)(4)
  *         @arg @ref LL_COMP_INPUT_PLUS_DAC2_CH2 (4)
  *
  *         (1) Specific to COMP instance: COMP1
  *         (2) Specific to COMP instance: COMP2 (available on devices STM32C53xx/54xx)
  *         (3) Parameters only available on STM32C5J1xx/5K1xx devices
  *         (4) Parameters only available on STM32C5P1xx/5Q1xx devices

  */
__STATIC_INLINE uint32_t LL_COMP_GetInputPlus(const COMP_TypeDef *p_comp)
{
  return (uint32_t)(STM32_READ_BIT(LL_COMP_REG(p_comp), COMP_CFGR1_INPSEL));
}

/**
  * @brief  Set comparator input minus.
  * @rmtoll
  *  CFGR1    INMSEL         LL_COMP_SetInputMinus \n
  *  CFGR1    BRGEN          LL_COMP_SetInputMinus \n
  *  CFGR1    SCALEN         LL_COMP_SetInputMinus
  * @param  p_comp Comparator instance
  * @param  input_minus This parameter can be one of the following values:
  *         @arg @ref LL_COMP_INPUT_MINUS_1_4VREFINT
  *         @arg @ref LL_COMP_INPUT_MINUS_1_2VREFINT
  *         @arg @ref LL_COMP_INPUT_MINUS_3_4VREFINT
  *         @arg @ref LL_COMP_INPUT_MINUS_VREFINT
  *         @arg @ref LL_COMP_INPUT_MINUS_IO1
  *         @arg @ref LL_COMP_INPUT_MINUS_IO2
  *         @arg @ref LL_COMP_INPUT_MINUS_IO3
  * @if COMP1
  *         @arg @ref LL_COMP_INPUT_MINUS_DAC1_CH1   (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_TEMPSENSOR (1)
  * @endif
  * @if COMP2
  *         @arg @ref LL_COMP_INPUT_MINUS_DAC1_CH2   (2)
  *         @arg @ref LL_COMP_INPUT_MINUS_OPAMP1_OUT (2)
  * @endif
  *         @arg @ref LL_COMP_INPUT_MINUS_DAC2_CH1 (3)
  *         @arg @ref LL_COMP_INPUT_MINUS_DAC2_CH2 (3)(4)
  *
  *         (1) Specific to COMP instance: COMP1
  *         (2) Specific to COMP instance: COMP2 (available on devices STM32C53xx/54xx)
  *         (3) Parameters only available on STM32C5J1xx/5K1xx devices
  *         (4) Parameters only available on STM32C5P1xx/5Q1xx devices

  * @note   In case of comparator input selected to be connected to IO:
  *         GPIO pins are specific to each comparator instance.
  *         Refer to description of parameters or to reference manual.
  * @note   Voltage scaler is used when selecting comparator input based on VrefInt (VrefInt or subdivision of VrefInt).
  *         In this case, specific delay must be fulfilled for voltage stabilization when enabling comparator,
  *         refer to LL_COMP_DELAY_VOLTAGE_SCALER_STAB_US.
  */
__STATIC_INLINE void LL_COMP_SetInputMinus(COMP_TypeDef *p_comp, uint32_t input_minus)
{
  STM32_MODIFY_REG(LL_COMP_REG(p_comp), COMP_CFGR1_INMSEL | COMP_CFGR1_SCALEN | COMP_CFGR1_BRGEN, input_minus);
}

/**
  * @brief  Get comparator input minus.
  * @rmtoll
  *  CFGR1    INMSEL         LL_COMP_GetInputMinus \n
  *  CFGR1    BRGEN          LL_COMP_GetInputMinus \n
  *  CFGR1    SCALEN         LL_COMP_GetInputMinus
  * @param  p_comp Comparator instance
  * @note   In case of comparator input selected to be connected to IO:
  *         GPIO pins are specific to each comparator instance.
  *         Refer to description of parameters or to reference manual.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_COMP_INPUT_MINUS_1_4VREFINT
  *         @arg @ref LL_COMP_INPUT_MINUS_1_2VREFINT
  *         @arg @ref LL_COMP_INPUT_MINUS_3_4VREFINT
  *         @arg @ref LL_COMP_INPUT_MINUS_VREFINT
  *         @arg @ref LL_COMP_INPUT_MINUS_IO1
  *         @arg @ref LL_COMP_INPUT_MINUS_IO2
  *         @arg @ref LL_COMP_INPUT_MINUS_IO3
  * @if COMP1
  *         @arg @ref LL_COMP_INPUT_MINUS_DAC1_CH1   (1)
  *         @arg @ref LL_COMP_INPUT_MINUS_TEMPSENSOR (1)
  * @endif
  * @if COMP2
  *         @arg @ref LL_COMP_INPUT_MINUS_DAC1_CH2   (2)
  *         @arg @ref LL_COMP_INPUT_MINUS_OPAMP1_OUT (2)
  * @endif
  *         @arg @ref LL_COMP_INPUT_MINUS_DAC2_CH1 (3)
  *         @arg @ref LL_COMP_INPUT_MINUS_DAC2_CH2 (3)(4)
  *
  *         (1) Specific to COMP instance: COMP1
  *         (2) Specific to COMP instance: COMP2 (available on devices STM32C53xx/54xx)
  *         (3) Parameters only available on STM32C5J1xx/5K1xx devices
  *         (4) Parameters only available on STM32C5P1xx/5Q1xx devices

  */
__STATIC_INLINE uint32_t LL_COMP_GetInputMinus(const COMP_TypeDef *p_comp)
{
  return (uint32_t)(STM32_READ_BIT(LL_COMP_REG(p_comp), COMP_CFGR1_INMSEL | COMP_CFGR1_SCALEN | COMP_CFGR1_BRGEN));
}

/**
  * @brief  Get comparator input voltage scaler bridge configuration.
  * @rmtoll
  *  CFGR1    BRGEN          LL_COMP_IsInputScalerEnabled \n
  *  CFGR1    SCALEN         LL_COMP_IsInputScalerEnabled
  * @param  p_comp Comparator instance
  * @note   Voltage scaler is used when selecting comparator input based on VrefInt (VrefInt or subdivision of VrefInt).
  *         In this case, specific delay must be fulfilled for voltage stabilization when enabling comparator,
  *         refer to LL_COMP_DELAY_VOLTAGE_SCALER_STAB_US.
  * @retval State of scaler bridge configuration (value "1" for enabled, value "0" for disabled).
  */
__STATIC_INLINE uint32_t LL_COMP_IsInputScalerEnabled(const COMP_TypeDef *p_comp)
{
  return ((STM32_READ_BIT(LL_COMP_REG(p_comp), (COMP_CFGR1_SCALEN | COMP_CFGR1_BRGEN)) != 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Enable comparator input temperature sensor buffer.
  * @rmtoll
  *  RCC_AHB2ENR AHB2ENR     LL_COMP_EnableInputTempSensorBuffer \n
  *  ADC_CCR     TSEN        LL_COMP_EnableInputTempSensorBuffer
  * @param  p_comp Comparator instance
  * @note   Specific configuration with bitfields out of comparator registers
  *         due to temperature sensor buffer controlled by ADC clock domain.
  *         Caution: ADC clock domain reset or disable impacts temperature sensor.
  * @note   Temperature sensor stabilization delay must be fulfilled,
  *         refer to LL_ADC_DELAY_TEMPSENSOR_STAB_US (in ADC LL driver) or device datasheet.
  *         Delay encompassed in LL_COMP_DELAY_STARTUP_US and LL_COMP_DELAY_VOLTAGE_SCALER_STAB_US,
  *         therefore no additional delay required for temperature sensor buffer.
  */
__STATIC_INLINE void LL_COMP_EnableInputTempSensorBuffer(COMP_TypeDef *p_comp)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(p_comp);

