MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_comp.h
  STM32_SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_ADC12EN);
  STM32_SET_BIT(ADC12_COMMON->CCR, ADCC_CCR_TSEN);
}

/**
  * @brief  Disable comparator input temperature sensor buffer.
  * @rmtoll
  *  ADC_CCR     TSEN        LL_COMP_DisableInputTempSensorBuffer
  * @param  p_comp Comparator instance
  * @note   Specific configuration with bitfields out of comparator registers
  *         due to temperature sensor buffer controlled by ADC clock domain.
  *         Clock domain of ADC not reset to not interfere with potential ADC operation.
  *         Caution: Temperature sensor buffer disable must not be performed if ADC expected
  *         to convert channel temperature sensor.
  */
__STATIC_INLINE void LL_COMP_DisableInputTempSensorBuffer(COMP_TypeDef *p_comp)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(p_comp);

  STM32_CLEAR_BIT(ADC12_COMMON->CCR, ADCC_CCR_TSEN);
}

/**
  * @brief  Get comparator input temperature sensor buffer configuration.
  * @rmtoll
  *  ADC_CCR     TSEN        LL_COMP_IsInputTempSensorBufferEnabled
  * @param  p_comp Comparator instance
  * @note   Specific configuration with bitfields out of comparator registers
  *         due to temperature sensor buffer controlled by ADC clock domain.
  */
__STATIC_INLINE uint32_t LL_COMP_IsInputTempSensorBufferEnabled(COMP_TypeDef *p_comp)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(p_comp);

  return ((STM32_READ_BIT(ADC12_COMMON->CCR, ADCC_CCR_TSEN) != 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Set comparator input hysteresis.
  * @rmtoll
  *  CFGR1    HYST           LL_COMP_SetInputHysteresis
  * @param  p_comp Comparator instance
  * @param  input_hysteresis This parameter can be one of the following values:
  *         @arg @ref LL_COMP_HYSTERESIS_NONE
  *         @arg @ref LL_COMP_HYSTERESIS_LOW
  *         @arg @ref LL_COMP_HYSTERESIS_MEDIUM
  *         @arg @ref LL_COMP_HYSTERESIS_HIGH
  * @note   Hysteresys applied on comparator input minus.
  */
__STATIC_INLINE void LL_COMP_SetInputHysteresis(COMP_TypeDef *p_comp, uint32_t input_hysteresis)
{
  STM32_MODIFY_REG(LL_COMP_REG(p_comp), COMP_CFGR1_HYST, input_hysteresis);
}

/**
  * @brief  Get comparator instance hysteresis mode of the minus (inverting) input.
  * @rmtoll
  *  CFGR1    HYST           LL_COMP_GetInputHysteresis
  * @param  p_comp Comparator instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_COMP_HYSTERESIS_NONE
  *         @arg @ref LL_COMP_HYSTERESIS_LOW
  *         @arg @ref LL_COMP_HYSTERESIS_MEDIUM
  *         @arg @ref LL_COMP_HYSTERESIS_HIGH
  */
__STATIC_INLINE uint32_t LL_COMP_GetInputHysteresis(const COMP_TypeDef *p_comp)
{
  return (uint32_t)(STM32_READ_BIT(LL_COMP_REG(p_comp), COMP_CFGR1_HYST));
}

/** @defgroup COMP_LL_EF_Configuration_comparator_output Configuration of comparator output
  * @{
  */

/**
  * @brief  Set comparator instance output polarity.
  * @rmtoll
  *  CFGR1    POLARITY       LL_COMP_SetOutputPolarity
  * @param  p_comp Comparator instance
  * @param  output_polarity This parameter can be one of the following values:
  *         @arg @ref LL_COMP_OUTPUTPOL_NONINVERTED
  *         @arg @ref LL_COMP_OUTPUTPOL_INVERTED
  */
__STATIC_INLINE void LL_COMP_SetOutputPolarity(COMP_TypeDef *p_comp, uint32_t output_polarity)
{
  STM32_MODIFY_REG(LL_COMP_REG(p_comp), COMP_CFGR1_POLARITY, output_polarity);
}

/**
  * @brief  Get comparator instance output polarity.
  * @rmtoll
  *  CFGR1    POLARITY       LL_COMP_GetOutputPolarity
  * @param  p_comp Comparator instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_COMP_OUTPUTPOL_NONINVERTED
  *         @arg @ref LL_COMP_OUTPUTPOL_INVERTED
  */
__STATIC_INLINE uint32_t LL_COMP_GetOutputPolarity(const COMP_TypeDef *p_comp)
{
  return (uint32_t)(STM32_READ_BIT(LL_COMP_REG(p_comp), COMP_CFGR1_POLARITY));
}

/**
  * @brief  Set comparator instance blanking source.
  * @rmtoll
  *  CFGR     BLANKING       LL_COMP_SetOutputBlankingSource
  * @param  p_comp Comparator instance
  * @param  blanking_source This parameter can be one of the following values:
  *         @arg @ref LL_COMP_BLANKINGSRC_NONE
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM1_OC5 (1)
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM1_OC5 (2)
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM2_OC3
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM5_OC3
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM5_OC4
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM8_OC5
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM15_OC2
  *         @arg @ref LL_COMP_BLANKINGSRC_LPTIM1_OC1 (2)
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM8_OC6 (3)
  *         @arg @ref LL_COMP_BLANKINGSRC_PLAY_OUT6 (3)
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM1_OC6 (3)
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM2_OC4 (3)
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM3_OC3 (3)
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM3_OC4 (3)
  *         @arg @ref LL_COMP_BLANKINGSRC_PLAY_OUT7 (3)
  *
  *         (1) On STM32C5, parameter available only on COMP instance: COMP1.
  *         (2) On STM32C5, parameter available only on COMP instance: COMP2.
  *         (3) On STM32C5, parameters available only on COMP instances: COMP3 and COMP4.

  * @note   Availability of parameters of blanking source from peripherals
  *         depends on their availability on the selected device.
  * @note   Blanking source can be specific to each comparator instance.
  *         Refer to description of parameters or to reference manual.
  */
__STATIC_INLINE void LL_COMP_SetOutputBlankingSource(COMP_TypeDef *p_comp, uint32_t blanking_source)
{
  STM32_MODIFY_REG(LL_COMP_REG(p_comp), COMP_CFGR1_BLANKING, blanking_source);
}

/**
  * @brief  Get comparator instance blanking source.
  * @rmtoll
  *  CFGR     BLANKING       LL_COMP_GetOutputBlankingSource
  * @param  p_comp Comparator instance
  * @note   Availability of parameters of blanking source from peripherals
  *         depends on their availability on the selected device.
  * @note   Blanking source can be specific to each comparator instance.
  *         Refer to description of parameters or to reference manual.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_COMP_BLANKINGSRC_NONE
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM1_OC5 (1)
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM1_OC5 (2)
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM2_OC3
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM5_OC3
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM5_OC4
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM8_OC5
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM15_OC2
  *         @arg @ref LL_COMP_BLANKINGSRC_LPTIM1_OC1 (2)
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM8_OC6 (3)
  *         @arg @ref LL_COMP_BLANKINGSRC_PLAY_OUT6 (3)
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM1_OC6 (3)
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM2_OC4 (3)
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM3_OC3 (3)
  *         @arg @ref LL_COMP_BLANKINGSRC_TIM3_OC4 (3)
  *         @arg @ref LL_COMP_BLANKINGSRC_PLAY_OUT7 (3)
  *
  *         (1) On STM32C5, parameter available only on COMP instance: COMP1.
  *         (2) On STM32C5, parameter available only on COMP instance: COMP2.
  *         (3) On STM32C5, parameters available only on COMP instances: COMP3 and COMP4.

  */
__STATIC_INLINE uint32_t LL_COMP_GetOutputBlankingSource(const COMP_TypeDef *p_comp)
{
  return (uint32_t)(STM32_READ_BIT(LL_COMP_REG(p_comp), COMP_CFGR1_BLANKING));
}

/**
  * @}
  */

