MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_comp.h
/** @defgroup COMP_LL_EF_Operation Operation on comparator instance
  * @{
  */

/**
  * @brief  Enable comparator instance.
  * @rmtoll
  *  CFGR1    EN             LL_COMP_Enable
  * @param  p_comp Comparator instance
  * @note   After enable, comparator requires a delay to reach reach propagation delay specification,
  *         refer to LL_COMP_DELAY_STARTUP_US.
  * @note   Voltage scaler is used when selecting comparator input based on VrefInt (VrefInt or subdivision of VrefInt).
  *         In this case, specific delay must be fulfilled for voltage stabilization when enabling comparator,
  *         refer to LL_COMP_DELAY_VOLTAGE_SCALER_STAB_US.
  *         To get scaler bridge configuration, refer to @ref LL_COMP_IsInputScalerEnabled().
  */
__STATIC_INLINE void LL_COMP_Enable(COMP_TypeDef *p_comp)
{
  STM32_SET_BIT(LL_COMP_REG(p_comp), COMP_CFGR1_EN);
}

/**
  * @brief  Disable comparator instance.
  * @rmtoll
  *  CFGR1    EN             LL_COMP_Disable
  * @param  p_comp Comparator instance
  */
__STATIC_INLINE void LL_COMP_Disable(COMP_TypeDef *p_comp)
{
  STM32_CLEAR_BIT(LL_COMP_REG(p_comp), COMP_CFGR1_EN);
}

/**
  * @brief  Get comparator enable state.
  * @rmtoll
  *  CFGR1    EN             LL_COMP_IsEnabled
  * @param  p_comp Comparator instance
  * @retval Value "0" for comparator disabled, value "1" for comparator enabled.
  */
__STATIC_INLINE uint32_t LL_COMP_IsEnabled(const COMP_TypeDef *p_comp)
{
  return ((STM32_READ_BIT(LL_COMP_REG(p_comp), COMP_CFGR1_EN) == (COMP_CFGR1_EN)) ? 1UL : 0UL);
}

/**
  * @brief  Lock comparator instance.
  * @rmtoll
  *  CFGR1    LOCK           LL_COMP_Lock
  * @param  p_comp Comparator instance
  * @note   Once locked, comparator configuration can be accessed in read-only.
  * @note   The only way to unlock the comparator is a device system reset.
  */
__STATIC_INLINE void LL_COMP_Lock(COMP_TypeDef *p_comp)
{
  STM32_SET_BIT(LL_COMP_REG(p_comp), COMP_CFGR1_LOCK);
}

/**
  * @brief  Get comparator lock state.
  * @rmtoll
  *  CFGR1    LOCK           LL_COMP_IsLocked
  * @param  p_comp Comparator instance
  * @note   Once locked, comparator configuration can be accessed in read-only.
  * @note   The only way to unlock the comparator is a device system reset.
  * @retval Value "0" for comparator unlocked, value "1" for comparator locked.
  */
__STATIC_INLINE uint32_t LL_COMP_IsLocked(const COMP_TypeDef *p_comp)
{
  return ((STM32_READ_BIT(LL_COMP_REG(p_comp), COMP_CFGR1_LOCK) == (COMP_CFGR1_LOCK)) ? 1UL : 0UL);
}

/**
  * @brief  Read comparator instance output level.
  * @rmtoll
  *  SR       C1VAL          LL_COMP_ReadOutputLevel
  * @if COMP2
  *  SR       C2VAL          LL_COMP_ReadOutputLevel
  * @endif
  * @param  p_comp Comparator instance
  * @note   The comparator output level depends on the selected polarity
  *         (Refer to function @ref LL_COMP_SetOutputPolarity()).
  *         If the comparator polarity is not inverted:
  *          - Comparator output is low when the input plus
  *            is at a lower voltage than the input minus
  *          - Comparator output is high when the input plus
  *            is at a higher voltage than the input minus
  *         If the comparator polarity is inverted:
  *          - Comparator output is high when the input plus
  *            is at a lower voltage than the input minus
  *          - Comparator output is low when the input plus
  *            is at a higher voltage than the input minus
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_COMP_OUTPUT_LEVEL_LOW
  *         @arg @ref LL_COMP_OUTPUT_LEVEL_HIGH
  */
__STATIC_INLINE uint32_t LL_COMP_ReadOutputLevel(const COMP_TypeDef *p_comp)
{
#if defined(COMP_CSR_VALUE)
  return (uint32_t)(STM32_READ_BIT(p_comp->CSR, COMP_CSR_VALUE) >> COMP_CSR_VALUE_Pos);
#else
#if defined(COMP2)
  if (p_comp == COMP1)
  {
    return (uint32_t)(STM32_READ_BIT(COMP12_COMMON->SR, COMP_SR_C1VAL));
  }
  else
  {
    return (uint32_t)((STM32_READ_BIT(COMP12_COMMON->SR, COMP_SR_C2VAL)) >> COMP_SR_C2VAL_Pos);
  }
#else
  return (uint32_t)(STM32_READ_BIT(p_comp->SR, COMP_SR_C1VAL));
#endif
#endif /* COMP_CSR_VALUE */
}

/**
  * @}
  */

#if defined(COMP_SR_C1IF)
/** @defgroup COMP_LL_EF_FLAG_Management Comparator flag Management
  * @{
  */

/**
  * @brief  Get comparator output trigger flag (latched).
  * @rmtoll
  *  SR       C1IF           LL_COMP_IsActiveFlag_OutputTrig
  * @if COMP2
  *  SR       C2IF           LL_COMP_IsActiveFlag_OutputTrig
  * @endif
  * @param  p_comp Comparator instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_COMP_IsActiveFlag_OutputTrig(const COMP_TypeDef *p_comp)
{
#if defined(COMP2)
  if (p_comp == COMP1)
  {
    return ((STM32_READ_BIT(COMP12_COMMON->SR, COMP_SR_C1IF) == (COMP_SR_C1IF)) ? 1UL : 0UL);
  }
  else
  {
    return ((STM32_READ_BIT(COMP12_COMMON->SR, COMP_SR_C2IF) == (COMP_SR_C2IF)) ? 1UL : 0UL);
  }
#else
  return ((STM32_READ_BIT(p_comp->SR, COMP_SR_C1IF) == (COMP_SR_C1IF)) ? 1UL : 0UL);
#endif /* COMP2 */
}

/**
  * @brief  Clear comparator comparator output trigger flag (latched).
  * @rmtoll
  *  ICFR     CC1IF          LL_COMP_ClearFlag_OutputTrig
  * @if COMP2
  *  ICFR     CC12F          LL_COMP_ClearFlag_OutputTrig
  * @endif
  * @param  p_comp Comparator instance
  */
__STATIC_INLINE void LL_COMP_ClearFlag_OutputTrig(COMP_TypeDef *p_comp)
{
#if defined(COMP2)
  if (p_comp == COMP1)
  {
    STM32_SET_BIT(COMP12_COMMON->ICFR, COMP_ICFR_CC1IF);
  }
  else
  {
    STM32_SET_BIT(COMP12_COMMON->ICFR, COMP_ICFR_CC2IF);
  }
#else
  STM32_SET_BIT(p_comp->ICFR, COMP_ICFR_CC1IF);
#endif /* COMP2 */
}

/**
  * @}
  */
#endif /* COMP_SR_C1IF */

#if defined(COMP_CFGR1_ITEN)
/** @defgroup COMP_LL_EF_IT_Management Comparator IT management
  * @{
  */

/**
  * @brief  Enable comparator output trigger interrupt.
  * @rmtoll
  *  CFGR1    ITEN           LL_COMP_EnableIT_OutputTrig
  * @param  p_comp Comparator instance
  */
__STATIC_INLINE void LL_COMP_EnableIT_OutputTrig(COMP_TypeDef *p_comp)
{
  STM32_SET_BIT(LL_COMP_REG(p_comp), COMP_CFGR1_ITEN);
}

/**
  * @brief  Disable comparator output trigger interrupt.
  * @rmtoll
  *  CFGR1    ITEN           LL_COMP_DisableIT_OutputTrig
  * @param  p_comp Comparator instance
  */
__STATIC_INLINE void LL_COMP_DisableIT_OutputTrig(COMP_TypeDef *p_comp)
{
  STM32_CLEAR_BIT(LL_COMP_REG(p_comp), COMP_CFGR1_ITEN);
}

/**
  * @brief  Get comparator output trigger interrupt state.
  * @rmtoll
  *  CFGR1    ITEN           LL_COMP_IsEnabledIT_OutputTrig
  * @param  p_comp Comparator instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_COMP_IsEnabledIT_OutputTrig(const COMP_TypeDef *p_comp)
{
  return ((STM32_READ_BIT(LL_COMP_REG(p_comp), COMP_CFGR1_ITEN) == (COMP_CFGR1_ITEN)) ? 1UL : 0UL);
}

/**
  * @}
  */
#endif /* COMP_CFGR1_ITEN */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* COMP1 || COMP2 || COMP3 || COMP4 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32C5XX_LL_COMP_H */
